src/Catalogs/ВложенияЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Catalog>
		<Properties>
			<Name>ВложенияЭлектронныхПисем</Name>
			<Comment>Вложения электронных писем</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Comment>Имя файла</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Comment>Хранилище</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДФайлаПочтовогоПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстФайла</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ВложенияЭлектронныхПисем/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;

	ДанныеХранилища = Хранилище.Получить();
	ТекстФайлаЗаписан = Ложь;
	Если ТипЗнч(ДанныеХранилища) = Тип("ДвоичныеДанные") Тогда
		ВременныйФайл = ПолучитьИмяВременногоФайла(РаботаСФайлами.ПолучитьРасширениеФайла(ИмяФайла));
		Попытка
			ДанныеХранилища.Записать(ВременныйФайл);
			Извлечение = Новый ИзвлечениеТекста(ВременныйФайл);
			ТекстФайла = Новый ХранилищеЗначения(Извлечение.ПолучитьТекст());
			ТекстФайлаЗаписан = Истина;
		Исключение
			ТекстФайлаЗаписан = Ложь;
		КонецПопытки;
		УдалитьФайлы(ВременныйФайл);
	КонецЕсли;
	
	Если НЕ ТекстФайлаЗаписан Тогда
		ТекстФайла = Новый ХранилищеЗначения("");
	КонецЕсли; 
	
	Если ТипЗнч(Объект) = Тип("ДокументСсылка.ЭлектронноеПисьмо")
	   И ТипЗнч(Объект.Предмет) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Предмет = Объект.Предмет;
	Иначе
		Предмет = Справочники.ФизическиеЛица.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры
